some-repository/STM32F401CC_USB/main.c
void send_ep (const uint8_t ep, const uint8_t *buf, const uint8_t len)
{
    if ((len != 0) && (buf == NULL))
    {
        return;
    }
    if (len > MAX_PACKET_SIZE_EP0) // check if len <= MAX_PACKET_SIZE_EP0
    {
        return;
    }

    while ((((USB_INEP(ep)->DTXFSTS) & 0xFFFF) * 4) < (uint32_t) len); // wait until there is enough space in TX FIFO

    uint8_t i, j;
    uint32_t tmp = 0;
    USB_INEP(ep)->DIEPTSIZ = (1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos) | len;       // one packet of len bytes
    USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;   // Enable endpoint, clear NAK bit     
    for (i = 0; i < ((len + 3) / 4); i++) 
    {
        tmp = 0;
        for (j = 0; j < 4; j++)
        {
            if (((i * 4) + j) < len)
            {
                tmp |= (((uint32_t) *(buf + (4 * i) + j)) << (8 * j));
            }
        }
        USB_FIFO(ep) = tmp; // Copy data 
    } 
}

/*void stall_TX_ep (uint8_t ep)
{
    USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
}*/

/*void USB_device_setup (uint8_t *buf)
{
    const uint8_t bmRequestType = buf [0];
    const uint8_t bRequest = buf [1];
    const uint16_t wValue = buf [2] | ((uint16_t) buf [3] << 8);
    const uint16_t wIndex = buf [4] | ((uint16_t) buf [5] << 8);  
    const uint16_t wLength = buf [6] | ((uint16_t) buf [7] << 8);

    switch (bmRequestType & REQUEST_RECIPIENT_MASK)
    {
        case RECIPIENT_DEVICE: // Recipient is device
        {
            switch (bmRequestType & REQUEST_TYPE_MASK)
            {
                case REQUEST_CLASS:
                case REQUEST_VENDOR:
                    break;
                case REQUEST_STANDARD:
                switch (bRequest)
                {
                    case GET_DESCRIPTOR:
                    {
                        print ("GET DESCRIPTOR\n", 15);

                        get_descriptor (wValue, wLength);
                        break;
                    }                               
                    case SET_ADDRESS:
                    {
                        print ("SET ADDRESS\n", 12);
                        
                        set_address (buf [2]);                                                     
                        break;
                    }
                    case SET_CONFIGURATION:
                    {
                        //setConfig ();
                        break;
                    }
                    case GET_CONFIGURATION:
                        break;
                    case GET_STATUS:
                        break;
                    case SET_FEATURE:
                        break;
                    case CLEAR_FEATURE:
                        break;
                    default:
                        break;
                }
            }
        }
        case RECIPIENT_ENDPOINT:
            break;
        case RECIPIENT_INTERFACE:
            break;
        default:
            break;
    }
}*/

/*void set_address (uint8_t address)
{
    print ("address = ", 10);
    print (&address, 1);
    print ("\n", 1);
    
    USB_OTG_DEV->DCFG |= (((uint32_t) address) << 4); // SEE ERRATA 2.8.4
    send_ep (0, 0, 0); 
}*/

/*void get_descriptor (uint16_t wValue, uint16_t wLength)
{
    uint8_t *ptr;
    uint8_t len = 0;
    switch (wValue >> 8)    
    {
        case DESC_DEVICE: // Request device descriptor
        {
            ptr = (uint8_t*) desc_device; 
            len = 18;             
            break;  
        }
                         
        case DESC_CONFIG: // Request configuration descriptor
        {
            ptr = (uint8_t*) desc_config;
            len = sizeof (desc_config);
            break;  
        }
                          
        case DESC_STRING: // Request string descriptor
        {
            switch (wValue & 0xFF) // Request string descriptor
            {
                case DESC_STR_LANGID:  // Lang
                {
                    ptr = (uint8_t*) desc_lang;
                    len = sizeof (desc_lang);   
                    break;
                }
                                                                  
                case DESC_STR_MFC:     // Manufacturer
                {
                    //pbuf = (uint8_t*) desc_vendor; 
                    //len = sizeof (desc_vendor);
                    break;
                }
                    
                case DESC_STR_PRODUCT: // Product
                {
                    //ptr = (uint8_t*) desc_product; 
                    //len = sizeof (desc_product);
                    break;
                }
                    
                case DESC_STR_SERIAL:  // SerialNumber
                {
                    //ptr = (uint8_t*) desc_serial;
                    //len = sizeof (desc_serial); 
                    break;
                }
                    
                case DESC_STR_CONFIG:  // Config
                {
                    ptr = (uint8_t*) desc_config;
                    len = sizeof (desc_config);
                    break;
                }
                    
                case DESC_STR_INTERFACE:// Interface
                    break;
                default:
                    break;
            }
            break;   
        }

        default:
        {
            stall_TX_ep (0); // we don't know how to handle this request                      
            break;  
        }    
    }
    if (len)
    {    
        send_ep (0, ptr, MIN(len, wLength));   
    }  
}*/

int main (void)
{
    RCC_config ();
    //GPIO_config ();
    UART_config ();
    USB_config ();
    //init ();

    print ("print test\n");

    while (1) 
    {

    }
}
//-------------------------------------------------------------------
/* This function is sending data */
void sendData(const uint8_t ep, const uint8_t *buf, uint8_t len)
{
 while(countTx);
 countTx = len;                                  // Save all len
 if(len > MAX_SIZE)                              // Larger maximum size?
          {                                          // Create queue for send
             len = MAX_SIZE;                           // Set maximum size
             bufTx =(uint8_t*) buf;                    //   Save ptr for new send
            }       
 send_ep (ep, buf, len);                             // Send data           
}
 
 
void sendEnd(const uint8_t ep) 
{
 if(countTx > MAX_SIZE)                          // If queue for send?
   {
      bufTx = (uint8_t*) (bufTx + MAX_SIZE);       // Calculating ptr for send
    countTx -= MAX_SIZE;                           // Calculating length
    send_ep (ep, bufTx, countTx);                    // Send data        
     }
 else countTx = 0;                               // No queue for send
}   
 
/* This function reads received data from the buffer */
/*uint16_t readData(const uint8_t ep, uint8_t *buf)
{
 uint16_t i, len = 0;
 if(ep == epNumLastRx)                                                           
   {
    if(countRx)                                      // If read data
          {
             for(i = 0; i < countRx; i++)
                  {
                     *buf++ = bufRx[i];                        // Copy data
                    }
             len = countRx;
       countRx = 0; 
       epNumLastRx = 0;                 
            }
   }         
 return len;
}*/
 
void setup(uint8_t *buf)
{
 const uint8_t bmRequestType = buf[0];
 const uint8_t bRequest = buf[1];
 const uint16_t wValue = buf[2] | ((uint16_t)buf[3] << 8);
 const uint16_t wIndex = buf[4] | ((uint16_t)buf[5] << 8);  
 const uint16_t wLength = buf[6] | ((uint16_t)buf[7] << 8); 
 uint8_t data[8];
 switch(bmRequestType & 0x1FU)
       {
          case REQ_DEVICE: 
                     switch(bmRequestType & REQ_MASK)
                               {
                                  case REQ_CLASS:
                                      case REQ_VENDOR:
                                        break;
                                        case REQ_STANDARD:
                                        switch(bRequest)
                                              {
                                                 case GET_DESCRIPTOR:
                                                        print ("GET_DESCRIPTOR\n");
                                                        getDesc(wValue, wLength);
                                                 break; 
                                                     case SET_ADDRESS:
                                                     print ("SET_ADDRESS\n");
                                                          setAddr(buf[2]);                                                     
                                                     break;
                                                     case SET_CONFIGURATION:
                                                            print ("SET_CONFIGURATION\n");
                                                            setConfig();
                           break;
                           case GET_CONFIGURATION:
                           break;
                           case GET_STATUS:
                           break;
                           case SET_FEATURE:
                           break;
                           case CLEAR_FEATURE:
                           break;
                           default:
                           break;
                                                    }                                       
                                        break;
                                     }
                break;
            case REQ_INTERFACE:
             
             sendData(0, data, wLength);
             if(bRequest == 34) countRx = 0;                
        break;              
            case REQ_ENDPOINT:  
                break;
             }
} 
 
 
void getDesc(uint16_t wValue, uint16_t wLength)
{
 uint8_t *pbuf;
 uint8_t len = 0;
 switch(wValue >> 8)    
       {
          case DESC_DEVICE:                  // Request device descriptor
                       pbuf = (uint8_t*)desc_device; 
             len = sizeof(desc_device);             
        break;  
        case DESC_CONFIG:                  // Request configuration descriptor
                       pbuf = (uint8_t*) desc_config;
                     len = sizeof(desc_config);
        break;   
        case DESC_STRING:                  // Request string descriptor
                     switch(wValue & 0xFF)         // Request string descriptor
                                   {
                                      case DESC_STR_LANGID:  // Lang
                                               pbuf = (uint8_t*) desc_lang;
                                                 len = sizeof(desc_lang);   
                    break;                                              
                                        /*case DESC_STR_MFC:     // Manufacturer
                         pbuf = (uint8_t*) desc_vendor, 
                                             len = sizeof(desc_vendor); 
                    break;
                    case DESC_STR_PRODUCT: // Product
                         pbuf = (uint8_t*) desc_product; 
                                             len = sizeof(desc_product);
                    break;
                    case DESC_STR_SERIAL:  // SerialNumber
                         pbuf = (uint8_t*) desc_serial;
                                     len = sizeof(desc_serial); 
                    break;*/
                                      case DESC_STR_CONFIG:  // Config
                                                 pbuf = (uint8_t*) desc_config;
                                         len = sizeof(desc_config);
                                      break;
                    case DESC_STR_INTERFACE:// Interface
                    break;
                    default:
                                        break;
                                     }                          
                break;                                      
                case DESC_OTHER_CONFIG:
                       stallTx(0); // we don't know how to handle this request                      
          break;
             }
 if(len)
   {    
      sendData(0, pbuf, MIN(len,wLength));   
     }  
}
 
 
void setAddr(uint8_t addr)
{
 USB_OTG_DEV->DCFG |= ((uint32_t)addr << 4);
 send_ep (0, 0, 0); 
}
 
 
void setConfig(void)
{               
 /* Open EP1 IN */
 USB_OTG_DEV->DAINTMSK |=   (1 << 1);                           // Enable Interupt
 USB_INEP(1)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM |     // Set DATA0
                           (1 << USB_OTG_DIEPCTL_TXFNUM_Pos)|   // TxFIFO number
                           USB_OTG_DIEPCTL_EPTYP_1 |            // Endpoint type bulk
                           USB_OTG_DIEPCTL_USBAEP |             // Active endpoint
                           MAX_SIZE;                            // Max packet size
 /* Open EP1 OUT */
 USB_OTG_DEV->DAINTMSK |= (1 << 17);                          // Enable Interupt
 USB_OUTEP(1)->DOEPCTL |= USB_OTG_DOEPCTL_EPENA |             // Endpoint enable
                            USB_OTG_DOEPCTL_SD0PID_SEVNFRM |    // Set DATA0
                            USB_OTG_DOEPCTL_CNAK |              // Clear NAK
                            USB_OTG_DOEPCTL_EPTYP_1 |           // Endpoint type bulk
                            USB_OTG_DOEPCTL_USBAEP |            // Active endpoint 
                            MAX_SIZE;                           // Max packet size
 /* Open Command EP2 IN  */
 USB_OTG_DEV->DAINTMSK |= (1 << 2);                           // Enable Interupt
 USB_INEP(2)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM |     // Set DATA0
                           (1 << USB_OTG_DIEPCTL_TXFNUM_Pos)|   // TxFIFO number
                           USB_OTG_DIEPCTL_EPTYP |              // Endpoint type Interrupt
                           USB_OTG_DIEPCTL_USBAEP |             // Active endpoint
                           MAX_SIZE;                            // Max packet size
 send_ep (0, 0, 0);
}
 
 
void flushTx(void)
{
 print ("flushTx\n");
 USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (1 << 10);
 while(USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
}
 
 
void flushRx(void)
{
 print ("flushRx\n");
 USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
 while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH);
}
 
 
void stallTx(uint8_t ep)
{
 print ("stallTx\n");
 USB_INEP(ep)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
}
